# YOLOv11 configuration file with CLFT
nc: 80 # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# Backbone
backbone:
  - [-1, 1, Focus, [64, 3]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, CLFT, [128, 256, 64]] # 添加 CLFT 模块
  - [-1, 3, BottleneckCSP, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 9, BottleneckCSP, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, BottleneckCSP, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, SPP, [1024, [5, 9, 13]]] # 8
  - [-1, 3, BottleneckCSP, [1024, False]] # 9

# Neck
neck:
  - [-1, 1, Conv, [512, 1, 1]] # 10
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12
  - [-1, 1, CLFT, [512, 512, 128]] # 添加 CLFT 模块
  - [-1, 3, BottleneckCSP, [512, False]] # 13
  - [-1, 1, Conv, [256, 1, 1]] # 14
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]] # 16
  - [-1, 3, BottleneckCSP, [256, False]] # 17

# Head
head:
  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]] # 19
  - [-1, 3, BottleneckCSP, [512, False]] # 20
  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 10], 1, Concat, [1]] # 22
  - [-1, 3, BottleneckCSP, [1024, False]] # 23
  - [[17, 20, 23], 1, Detect, [nc]] # 24
